UTAF_Base/requestFiles/LEF_PersonCreating.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://api.web.bc/api/schema/commoncontext/v2" xmlns:v1="http://api.web.bc/api/schema/commoncontext/transaction/v1" xmlns:v11="http://api.web.bc/api/schema/commoncontext/consumertransaction/v1" xmlns:v12="http://api.web.bc/capability/business/b182-01/services/personcreating/flv000023/v1" xmlns:v13="http://api.web.bc/capability/business/b182-01/objects/requestsubmitpersoncreating/flv000023/v1">
   <soapenv:Header>
      <v2:CommonContextRequest>
         <v2:transaction>
            <v1:messageId>${Req_corrId}</v1:messageId>
            <v1:correlationId>${Req_corrId}</v1:correlationId>
         </v2:transaction>
      </v2:CommonContextRequest>
   </soapenv:Header>
   <soapenv:Body>
      <v12:RequestDataSubmitPersonCreating>
         <v12:serviceContext>
            <v12:transactionData>
               <v12:endUserId>609496301</v12:endUserId>
               <v12:endUserLanguage>EN</v12:endUserLanguage>
               <v12:consumerApplication>CDB</v12:consumerApplication>
            </v12:transactionData>
         </v12:serviceContext>
         <v12:serviceData>
            <v12:person>
               <v13:name>
                 <v13:firstName>${Req_firstName}</v13:firstName>
                  <v13:lastName>${Req_lastName}</v13:lastName>
               </v13:name>
			<v13:birthDate>${Req_birthDate}</v13:birthDate>
			<v13:gender>
                  <v13:value>M</v13:value>
               </v13:gender>
               <v13:party>
                  <v13:preferredCommunicationLanguage>
                     <v13:alpha2Code>EN</v13:alpha2Code>
                  </v13:preferredCommunicationLanguage>
				</v13:party>
            </v12:person>
            <v12:contact>
               <v13:contactMedium>
                  <v13:EMailContact>
                     <v13:EMailAddress>${Req_EMailAddress}</v13:EMailAddress>
                  </v13:EMailContact>
               </v13:contactMedium>
            </v12:contact>            
         </v12:serviceData>
      </v12:RequestDataSubmitPersonCreating>
   </soapenv:Body>
</soapenv:Envelope>
